pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/eUSCI_A1_445.xml
<module id="eUSCI_A1" HW_revision="445">
    <register id="UCA1CTLW0" width="16" offset="0x0" internal="0" description="eUSCI_Ax Control Word Register 0">
        <bitfield id="UCSWRST" description="Software reset enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disabled. eUSCI_A reset released for operation"/>
            <bitenum id="ENABLE" value="0x1" description="Enabled. eUSCI_A logic held in reset state"/>
        </bitfield>
        <bitfield id="UCTXBRK" description="Transmit break" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXBRK_0" value="0x0" description="Next frame transmitted is not a break"/>
            <bitenum id="UCTXBRK_1" value="0x1" description="Next frame transmitted is a break or a break/synch"/>
        </bitfield>
        <bitfield id="UCTXADDR" description="Transmit address" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCTXADDR_0" value="0x0" description="Next frame transmitted is data"/>
            <bitenum id="UCTXADDR_1" value="0x1" description="Next frame transmitted is an address"/>
        </bitfield>
        <bitfield id="UCDORM" description="Dormant" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCDORM_0" value="0x0" description="Not dormant. All received characters set UCRXIFG."/>
            <bitenum id="UCDORM_1" value="0x1" description="Dormant. Only characters that are preceded by an idle-line or with address bit set UCRXIFG. In UART mode with automatic baud-rate detection, only the combination of a break and synch field sets UCRXIFG."/>
        </bitfield>
        <bitfield id="UCBRKIE" description="Receive break character interrupt enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="UCBRKIE_0" value="0x0" description="Received break characters do not set UCRXIFG"/>
            <bitenum id="UCBRKIE_1" value="0x1" description="Received break characters set UCRXIFG"/>
        </bitfield>
        <bitfield id="UCRXEIE" description="Receive erroneous-character interrupt enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCRXEIE_0" value="0x0" description="Erroneous characters rejected and UCRXIFG is not set"/>
            <bitenum id="UCRXEIE_1" value="0x1" description="Erroneous characters received set UCRXIFG"/>
        </bitfield>
        <bitfield id="UCSSEL" description="eUSCI_A clock source select" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="UCLK" value="0x0" description="UCLK"/>
            <bitenum id="ACLK" value="0x1" description="ACLK"/>
            <bitenum id="SMCLK" value="0x2" description="SMCLK"/>
            <bitenum id="UCSSEL_3" value="0x3" description="SMCLK"/>
        </bitfield>
        <bitfield id="UCSYNC" description="Synchronous mode enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ASYNC" value="0x0" description="Asynchronous mode"/>
            <bitenum id="SYNC" value="0x1" description="Synchronous mode"/>
        </bitfield>
        <bitfield id="UCMODE" description="eUSCI_A mode" begin="10" end="9" width="2" rwaccess="R/W">
            <bitenum id="UCMODE_0" value="0x0" description="UART mode"/>
            <bitenum id="UCMODE_1" value="0x1" description="Idle-line multiprocessor mode"/>
            <bitenum id="UCMODE_2" value="0x2" description="Address-bit multiprocessor mode"/>
            <bitenum id="UCMODE_3" value="0x3" description="UART mode with automatic baud-rate detection"/>
        </bitfield>
        <bitfield id="UCSPB" description="Stop bit select" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="UCSPB_0" value="0x0" description="One stop bit"/>
            <bitenum id="UCSPB_1" value="0x1" description="Two stop bits"/>
        </bitfield>
        <bitfield id="UC7BIT" description="Character length" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="8BIT" value="0x0" description="8-bit data"/>
            <bitenum id="7BIT" value="0x1" description="7-bit data"/>
        </bitfield>
        <bitfield id="UCMSB" description="MSB first select" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="UCMSB_0" value="0x0" description="LSB first"/>
            <bitenum id="UCMSB_1" value="0x1" description="MSB first"/>
        </bitfield>
        <bitfield id="UCPAR" description="Parity select" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ODD" value="0x0" description="Odd parity"/>
            <bitenum id="EVEN" value="0x1" description="Even parity"/>
        </bitfield>
        <bitfield id="UCPEN" description="Parity enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="UCPEN_0" value="0x0" description="Parity disabled"/>
            <bitenum id="UCPEN_1" value="0x1" description="Parity enabled. Parity bit is generated (UCAxTXD) and expected (UCAxRXD). In address-bit multiprocessor mode, the address bit is included in the parity calculation."/>
        </bitfield>
    </register>
    <register id="UCA1CTLW0_SPI" width="16" offset="0x0" internal="0" description="eUSCI_Ax Control Word Register 0">
        <bitfield id="UCSWRST" description="Software reset enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disabled. eUSCI_A reset released for operation"/>
            <bitenum id="ENABLE" value="0x1" description="Enabled. eUSCI_A logic held in reset state"/>
        </bitfield>
        <bitfield id="UCSTEM" description="STE mode select in master mode." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCSTEM_0" value="0x0" description="STE pin is used to prevent conflicts with other masters"/>
            <bitenum id="UCSTEM_1" value="0x1" description="STE pin is used to generate the enable signal for a 4-wire slave"/>
        </bitfield>
        <bitfield id="UCSSEL" description="eUSCI_A clock source select" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="UCSSEL_0" value="0x0" description="Reserved"/>
            <bitenum id="ACLK" value="0x1" description="ACLK"/>
            <bitenum id="SMCLK" value="0x2" description="SMCLK"/>
            <bitenum id="UCSSEL_3" value="0x3" description="SMCLK"/>
        </bitfield>
        <bitfield id="UCSYNC" description="Synchronous mode enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ASYNC" value="0x0" description="Asynchronous mode"/>
            <bitenum id="SYNC" value="0x1" description="Synchronous mode"/>
        </bitfield>
        <bitfield id="UCMODE" description="eUSCI mode" begin="10" end="9" width="2" rwaccess="R/W">
            <bitenum id="UCMODE_0" value="0x0" description="3-pin SPI"/>
            <bitenum id="UCMODE_1" value="0x1" description="4-pin SPI with UCxSTE active high: Slave enabled when UCxSTE = 1"/>
            <bitenum id="UCMODE_2" value="0x2" description="4-pin SPI with UCxSTE active low: Slave enabled when UCxSTE = 0"/>
            <bitenum id="UCMODE_3" value="0x3" description="I2C mode"/>
        </bitfield>
        <bitfield id="UCMST" description="Master mode select" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SLAVE" value="0x0" description="Slave mode"/>
            <bitenum id="MASTER" value="0x1" description="Master mode"/>
        </bitfield>
        <bitfield id="UC7BIT" description="Character length" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="8BIT" value="0x0" description="8-bit data"/>
            <bitenum id="7BIT" value="0x1" description="7-bit data"/>
        </bitfield>
        <bitfield id="UCMSB" description="MSB first select" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="UCMSB_0" value="0x0" description="LSB first"/>
            <bitenum id="UCMSB_1" value="0x1" description="MSB first"/>
        </bitfield>
        <bitfield id="UCCKPL" description="Clock polarity select" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="The inactive state is low"/>
            <bitenum id="HIGH" value="0x1" description="The inactive state is high"/>
        </bitfield>
        <bitfield id="UCCKPH" description="Clock phase select" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="UCCKPH_0" value="0x0" description="Data is changed on the first UCLK edge and captured on the following edge."/>
            <bitenum id="UCCKPH_1" value="0x1" description="Data is captured on the first UCLK edge and changed on the following edge."/>
        </bitfield>
    </register>
    <register id="UCA1CTLW1" width="16" offset="0x2" internal="0" description="eUSCI_Ax Control Word Register 1">
        <bitfield id="UCGLIT" description="Deglitch time" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="UCGLIT_0" value="0x0" description="Approximately 2 ns (equivalent of 1 delay element)"/>
            <bitenum id="UCGLIT_1" value="0x1" description="Approximately 50 ns"/>
            <bitenum id="UCGLIT_2" value="0x2" description="Approximately 100 ns"/>
            <bitenum id="UCGLIT_3" value="0x3" description="Approximately 200 ns"/>
        </bitfield>
    </register>
    <register id="UCA1BRW" width="16" offset="0x6" internal="0" description="eUSCI_Ax Baud Rate Control Word Register">
    </register>
